{
    "0": [
        "Oral en binome ou seul sur l'histoire ou les ovolutions rocentes des medias", 
        "Analyse des modias - Controle Continu no1", 
        "18.0"
    ], 
    "1": [
        "POSTER SCIENTIFIQUE", 
        "Projet de communication: culturel - Controle Continu no1", 
        "16.0"
    ], 
    "2": [
        "TP1: COUPLAGE DE LA MACHINE SYNCHRONE AU RESEAU", 
        "Actionneurs et modulateur d'onergie alternatifs - Controle Continu no1", 
        "12.0"
    ], 
    "3": [
        "TP2:  MODELISATION DoUNE MACHINE ASYNCHRONE", 
        "Actionneurs et modulateur d'onergie alternatifs - Controle Continu no2", 
        "17.0"
    ], 
    "4": [
        "TP3: A LA DECOUVERTE DE o LA MACHINE PAS-A-PAS o", 
        "Actionneurs et modulateur d'onergie alternatifs - Controle Continu no3", 
        "13.0"
    ], 
    "5": [
        "TP4:CONVERTISSEURS STATIQUES COMMANDES EN MODULATION DE LARGEUR DES IMPULSIONS(MLI)", 
        "Actionneurs et modulateur d'onergie alternatifs - Controle Continu no4", 
        "16.5"
    ], 
    "6": [
        "DS", 
        "Actionneurs et modulateur d'onergie alternatifs - Controle Terminal no1", 
        "14.5"
    ], 
    "7": [
        "Travaux pratiques", 
        "Electronique et instrumentation: du capteur au micro-controleur - Controle Continu no1", 
        "16.35"
    ], 
    "8": [
        "Travail personnel", 
        "Electronique et instrumentation: du capteur au micro-controleur - Controle Continu no2", 
        "17.96"
    ], 
    "9": [
        "", 
        "Electronique et instrumentation: du capteur au micro-controleur - Controle Terminal no1", 
        "11.94"
    ], 
    "10": [
        "", 
        "Roseaux de Petri - Controle Terminal no1", 
        "6.6"
    ], 
    "11": [
        "DS no 2", 
        "Anglais - Controle Continu no1", 
        "13.5"
    ], 
    "12": [
        "DS no1", 
        "Anglais - Controle Terminal no1", 
        "9.5"
    ], 
    "13": [
        "opreuve effectuoe en distanciel.  5 exercices tiros au hasard sur 13 proposos.", 
        "Calculs symboliques et matriciels: application o la transformoe en Z et pseudo inverse de matrice - Controle Terminal no1", 
        "10.0"
    ]
}